In [81]:
# Step 1 - Import the necessary libraries
import numpy as np
import pandas as pd
print(pd.__version__)

1.0.1

In [82]:
# Step 2 - Create the 3 DataFrames based on the following raw data
raw_data_1 = {'subject': ['Human', 'English', 'Programation', 'Computer A', 'Math'],
        'first_name': ['Alejandro', 'Juan', 'Adriana', 'Efrain', 'Augusto'], 
        'last_name': ['Medina', 'Gabriel', 'Uc', 'Matu', 'Noh']}

raw_data_2 = {'subject': ['Statistics', 'Human', 'English', 'Programation', 'Computer A'],
        'first_name': ['Benjamin', 'Gabriel', 'Pedro', 'Emmanuel', 'Sahid'], 
        'last_name': ['Barona', 'Martin', 'Pech', 'Hurtado', 'Limon']}

raw_data_3 = {'subject': ['Statistics', 'Human', 'English', 'Programation', 'Computer A', 'Math',
                             'Trigonometry', 'Physic', 'Data', '0-0'],
        'id': [1909119, 1909127, 1909017, 1909119, 1909100, 1909182, 1909101, 1909098, 
                    1909109, 1909118]}

In [83]:
# Step 3 - Assign each to a variable called data1, data2, data3
data1 = pd.DataFrame(raw_data_1, columns = ['subject', 'first_name', 'last_name'])
data2 = pd.DataFrame(raw_data_2, columns = ['subject', 'first_name', 'last_name'])
data3 = pd.DataFrame(raw_data_3, columns = ['subject','id'])

In [84]:
# Step 4 - Join the two dataframes along rows and assign all_data
all_data = pd.concat([data1, data2])

In [85]:
# Step 5 - Join the two dataframes along columns and assing to all_data_col
all_data_col = pd.concat([data1, data2], axis = 1)

In [86]:
# Step 6 - Merge all_data and data3 along the subject value
pd.merge(all_data, data3, on='subject')

        subject first_name last_name       id
0         Human  Alejandro    Medina  1909127
1         Human    Gabriel    Martin  1909127
2       English       Juan   Gabriel  1909017
3       English      Pedro      Pech  1909017
4  Programation    Adriana        Uc  1909119
5  Programation   Emmanuel   Hurtado  1909119
6    Computer A     Efrain      Matu  1909100
7    Computer A      Sahid     Limon  1909100
8          Math    Augusto       Noh  1909182
9    Statistics   Benjamin    Barona  1909119

In [87]:
# Step 7 - Merge all values in data1 and data2, with matching records from both sides where available.
pd.merge(data1, data2, on='subject', how='outer')

        subject first_name_x last_name_x first_name_y last_name_y
0         Human    Alejandro      Medina      Gabriel      Martin
1       English         Juan     Gabriel        Pedro        Pech
2  Programation      Adriana          Uc     Emmanuel     Hurtado
3    Computer A       Efrain        Matu        Sahid       Limon
4          Math      Augusto         Noh          NaN         NaN
5    Statistics          NaN         NaN     Benjamin      Barona